settings.el

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

; Check if system is windows
(defun system-type-is-win ()
(interactive)
"Return true if system is windows"
(string-equal system-type "windows-nt")
)

;; Check if system is GNU/Linux
(defun system-type-is-gnu ()
(interactive)
"Return true if system is GNU/Linux-based"
(string-equal system-type "gnu/linux")
)

;;;add custom themes to list
  (add-to-list 'custom-theme-load-path "/home/zeltak/.emacs.d/themes")
  ;to load a specifc theme 
  ;(load-file "~/.emacs.d/themes/zprime-theme.el")
  ;load the choosen theme at startup 
  (load-theme 'zprime t)

;;;; below works but changes GUI apps theme when launching term..not good..maybe look into this in future  

;; ;; last t is for NO-ENABLE
  ;;   (load-theme 'zprime t t)
  ;;   (load-theme 'tango-dark t t)
  
  ;;   (defun mb/pick-color-theme (frame)
  ;;     (select-frame frame)
  ;;     (if (window-system frame)
  ;;         (progn  
  ;;           (disable-theme 'tango-dark) ; in case it was active
  ;;           (enable-theme 'zprime))
  ;;       (progn  
  ;;         (disable-theme 'zprime) ; in case it was active
  ;;         (enable-theme 'tango-dark))))
  ;;   (add-hook 'after-make-frame-functions 'mb/pick-color-theme)
  
  ;;   ;; For when started with emacs or emacs -nw rather than emacs --daemon
  ;;   (if window-system
  ;;       (enable-theme 'zprime)
  ;;     (enable-theme 'tango-dark))

; fonts in linux
(if (system-type-is-gnu)
;(add-to-list 'default-frame-alist '(font . "Inconsolata-16"))
;(add-to-list 'default-frame-alist '(font . "Source Code Pro-14"))
(add-to-list 'default-frame-alist '(font . "Pragmata Pro-16"))
)

;; fontso in Win
(if (system-type-is-win)
(add-to-list 'default-frame-alist '(font . "Consolas-14"))
)

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
;; UTF-8 as default encoding
(set-language-environment "UTF-8")

;; backwards compatibility as default-buffer-file-coding-system
;; is deprecated in 23.2.
(if (boundp 'buffer-file-coding-system)
    (setq-default buffer-file-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8))
 
;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(setq dcsh-command-list '("all_registers"
                               "check_design" "check_test" "compile" "current_design"
                               "link" "uniquify"
                               "report_timing" "report_clocks" "report_constraint"
                               "get_unix_variable" "set_unix_variable"
                               "set_max_fanout"
                               "report_area" "all_clocks" "all_inputs" "all_outputs"))
  
     (defun he-dcsh-command-beg ()
       (let ((p))
         (save-excursion
           (backward-word 1)
           (setq p (point)))
         p))
  
     (defun try-expand-dcsh-command (old)
       (unless old
         (he-init-string (he-dcsh-command-beg) (point))
         (setq he-expand-list (sort
                               (all-completions he-search-string (mapcar 'list dcsh-command-list))
                               'string-lessp)))
       (while (and he-expand-list
               (he-string-member (car he-expand-list) he-tried-table))
         (setq he-expand-list (cdr he-expand-list)))
       (if (null he-expand-list)
           (progn
             (when old (he-reset-string))
             ())
         (he-substitute-string (car he-expand-list))
         (setq he-tried-table (cons (car he-expand-list) (cdr he-tried-table)))
         (setq he-expand-list (cdr he-expand-list))
         t))

 (setq hippie-expand-try-functions-list (cons 'yas/hippie-try-expand hippie-expand-try-functions-list))

 (defun my-hippie-expand-completions (&optional hippie-expand-function)
       "Return the full list of possible completions generated by `hippie-expand'.
     The optional argument can be generated with `make-hippie-expand-function'."
       (let ((this-command 'my-hippie-expand-completions)
             (last-command last-command)
             (buffer-modified (buffer-modified-p))
             (hippie-expand-function (or hippie-expand-function 'hippie-expand)))
         (flet ((ding)) ; avoid the (ding) when hippie-expand exhausts its options.
           (while (progn
                    (funcall hippie-expand-function nil)
                    (setq last-command 'my-hippie-expand-completions)
                    (not (equal he-num -1)))))
         ;; Evaluating the completions modifies the buffer, however we will finish
         ;; up in the same state that we began, and (save-current-buffer) seems a
         ;; bit heavyweight in the circumstances.
         (set-buffer-modified-p buffer-modified)
         ;; Provide the options in the order in which they are normally generated.
         (delete he-search-string (reverse he-tried-table))))
   
     (defmacro my-ido-hippie-expand-with (hippie-expand-function)
       "Generate an interactively-callable function that offers ido-based completion
     using the specified hippie-expand function."
       `(call-interactively
         (lambda (&optional selection)
           (interactive
            (let ((options (my-hippie-expand-completions ,hippie-expand-function)))
              (if options
                  (list (ido-completing-read "Completions: " options)))))
           (if selection
               (he-substitute-string selection t)
             (message "No expansion found")))))
   
     (defun my-ido-hippie-expand ()
       "Offer ido-based completion for the word at point."
       (interactive)
       (my-ido-hippie-expand-with 'hippie-expand))
   
;; (global-set-key (kbd "<f12>") 'my-ido-hippie-expand)
;; (global-set-key [(meta f5)] (make-hippie-expand-function
;;                                '(try-expand-dcsh-command
;;                                  try-expand-dabbrev-visible
;;                                  try-expand-dabbrev
;;                                  try-expand-dabbrev-all-buffers) t))
(global-set-key (kbd "M-/") 'hippie-expand)
;; (global-set-key (kbd "TAB") 'hippie-expand)

;; (ido-mode 1)
;; (require 'flx-ido)
