settings.el
;; (ido-everywhere 1)
;; (flx-ido-mode 1)
;; ;; disable ido faces to see flx highlights.
;; (setq ido-use-faces nil)


;; (setq ido-max-directory-size 100000)
;; (ido-mode (quote both))
;; ; Use the current window when visiting files and buffers with ido
;; (setq ido-default-file-method 'selected-window)
;; (setq ido-default-buffer-method 'selected-window)



;; ;ignore case
;; (setq ido-case-fold t)
;; (setq ido-enable-flex-matching t) ; fuzzy matching is a must have

;; ;ido-ubiquitous

;; ;recents ido
;; (defun recentf-ido-find-file ()
;;   "Find a recent file using ido."
;;   (interactive)
;;   (let ((file (ido-completing-read "Choose recent file: " recentf-list nil t)))
;;     (when file
;;      (find-file file))))


;; ;this keybinding lets you even more quickly reach your home folder when in ido-find-file.

;; (add-hook 'ido-setup-hook
;;  (lambda ()
;;    ;; Go straight home
;;    (define-key ido-file-completion-map
;;      (kbd "~")
;;      (lambda ()
;;        (interactive)
;;        (if (looking-back "/")
;;            (insert "~/")
;;          (call-interactively 'self-insert-command))))))

(use-package ace-window
    :config
;set keys to only these 
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (setq aw-background nil))

(custom-set-faces
 '(aw-leading-char-face
   ((t (:inherit ace-jump-face-foreground :height 3.0)))))

(use-package ace-jump-zap
  :ensure ace-jump-zap
)

(use-package ace-isearch
 :ensure t
 :config
 (ace-isearch-mode +1)
 (global-ace-isearch-mode +1)
(setq ace-isearch-function 'avy-goto-word-1)
 )

(custom-set-variables
  '(ace-isearch-input-length 9)
  '(ace-isearch-input-idle-delay 0.4)
  '(ace-isearch-submode 'ace-jump-char-mode)
  '(ace-isearch-use-ace-jump 'printing-char)
)

(use-package ace-link
 :ensure t
 :config
(ace-link-setup-default)
 
 )

(use-package anzu
 :ensure t
 :config
(require 'anzu)
(global-anzu-mode +1)

(set-face-attribute 'anzu-mode-line nil
                    :foreground "yellow" :weight 'bold)

(custom-set-variables
 '(anzu-mode-lighter "")
 '(anzu-deactivate-region t)
 '(anzu-search-threshold 1000)
 '(anzu-replace-to-string-separator " => "))
 
(global-set-key (kbd "M-%") 'anzu-query-replace)
(global-set-key (kbd "C-M-%") 'anzu-query-replace-regexp)

 )

(use-package async
:ensure t)

;(require 'tex)
;(setq preview-scale-function 1.1)

(use-package auto-complete
 :ensure t
 :config
(ac-config-default)

;start after 4 characters
(setq ac-auto-start 4)
;fix linium issues
(ac-linum-workaround)

;; Examples
(set-face-background 'ac-candidate-face "lightgray")
(set-face-underline 'ac-candidate-face "darkgray")
(set-face-background 'ac-selection-face "steelblue")

)

(use-package avy
 :ensure t
 :config
(defcustom avy-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)
  "Keys for jumping.") 
 )

(use-package avy-zap
 :ensure t
 :config
 
 )

(use-package bookmark+
:ensure t
:config
(setq bookmark-version-control t
      bookmark-save-flag t)
;ask for tags when saving a bookmark move nil to t to ask each time
(setq bmkp-prompt-for-tags-flag nil)
)

(use-package browse-kill-ring
:ensure t
:config
)

(use-package bug-hunter
 :ensure t
 :config
  )

(use-package color-theme-approximate
 :ensure t
 :config
(color-theme-approximate-on)
 )

(use-package company
 :ensure t
 :config
;(add-hook 'after-init-hook 'global-company-mode)
 )

(require 'dired-x)
(setq dired-guess-shell-alist-user
      '(("\\.e?ps$" "gv" "xloadimage" "lpr")
        ("\\.chm$" "xchm")
        ("\\.rar$" "unrar x")
        ("\\.e?ps\\.g?z$" "gunzip -qc * | gv -")
        ("\\.pdf$" "okular" "zathura")
        ("\\.flv$" "mplayer")
        ("\\.mov$" "mplayer")
        ("\\.3gp$" "mplayer")
        ("\\.png$" "feh")
        ("\\.jpg$" "feh")
        ("\\.JPG$" "feh")
        ("\\.avi$" "mplayer")))

(use-package dired-sort
 :ensure t
 :config
  )

(use-package dired+
 :ensure t
 :config
(toggle-diredp-find-file-reuse-dir 1)
  )

;; (use-package dired-details
;;  :ensure t
;;  :config
;; (setq dired-details-hide-link-targets nil)
;;  )

;; (use-package dired-details+
;;  :ensure t
;;  :config
;;  )

(use-package peep-dired
 :ensure t
 :config
 (setq peep-dired-ignored-extensions '("mkv" "iso" "mp4"))
 )

(use-package dired-avfs
 :ensure t
 :config
 )

(use-package dired-filter
 :ensure t
 :config
 )

(use-package dired-narrow
 :ensure t
 :config
 )

(use-package dired-efap
 :ensure t
 :config
 
 )

(use-package dired-rainbow
 :ensure t
 :config
 (require 'dired-rainbow)

(defconst dired-audio-files-extensions
  '("mp3" "MP3" "ogg" "OGG" "flac" "FLAC" "wav" "WAV")
  "Dired Audio files extensions")
(dired-rainbow-define audio "#329EE8" dired-audio-files-extensions)

(defconst dired-video-files-extensions
    '("vob" "VOB" "mkv" "MKV" "mpe" "mpg" "MPG" "mp4" "MP4" "ts" "TS" "m2ts"
      "M2TS" "avi" "AVI" "mov" "MOV" "wmv" "asf" "m2v" "m4v" "mpeg" "MPEG" "tp")
    "Dired Video files extensions")
(dired-rainbow-define video "#006EFF" dired-video-files-extensions)

(defconst dired-pdf-files-extensions
  '("pdf" "PDF")
  "Dired pdf files extensions")
(dired-rainbow-define pdf "#FF0000" dired-pdf-files-extensions)


(defconst dired-org-files-extensions
  '("org" "ORG")
  "Dired org files extensions")
(dired-rainbow-define org "#FF00A2" dired-org-files-extensions)


(defconst dired-compressed-files-extensions
  '("zip" "ZIP"  "tar.bz" "tar.gz" "7zip" "7ZIP" "tar" "TAR" "rar" "RAR")
  "Dired compressed files extensions")
(dired-rainbow-define compressed "#B56A00" dired-compressed-files-extensions)




 )

(add-to-list 'load-path "/home/zeltak/.emacs.g/tmtxt-async-tasks")
 (add-to-list 'load-path "/home/zeltak/.emacs.g/tmtxt-dired-async")
(require 'tmtxt-async-tasks)
(require 'tmtxt-dired-async)

(setq-default tat/window-close-delay "2")
(setq-default tat/window-height 15)

(use-package drag-stuff
 :ensure t
 :config
  )
