settings.org
** ebib

#+BEGIN_SRC emacs-lisp :results none
(use-package ebib
 :ensure t
 :config
(setq ebib-preload-bib-files '("/home/zeltak/org/files/Uni/papers/kloog.2015.bib")) 

(setq ebib-common-optional-fields
      '(translator keywords origlanguage url file location
        partinfo subtitle edition abstract note annotator
        crossref urldate address subtitle language))

(setq ebib-file-associations '(("pdf" . "okular") ("djvu" . "okular")))
(setq ebib-uniquify-keys t)
(setq ebib-autogenerate-keys t)
(setq ebib-index-window-size 20)
(setq ebib-print-multiline t)

;index view
(setq ebib-index-display-fields (quote (year author)))
(setq ebib-sort-order (quote ((year) (author) )))

 )
#+END_SRC 
** edit-server (for chrome interaction)
 #+BEGIN_SRC emacs-lisp :results none
   ;; (require 'edit-server)
   ;;  (edit-server-start)
   ;; (autoload 'edit-server-maybe-dehtmlize-buffer "edit-server-htmlize" "edit-server-htmlize" t)
   ;; (autoload 'edit-server-maybe-htmlize-buffer   "edit-server-htmlize" "edit-server-htmlize" t)
   ;; (add-hook 'edit-server-start-hook 'edit-server-maybe-dehtmlize-buffer)
   ;; (add-hook 'edit-server-done-hook  'edit-server-maybe-htmlize-buffer)
 #+END_SRC
** engine-mode
   
#+BEGIN_SRC emacs-lisp :results none
(use-package engine-mode
 :ensure t
 :config 
 )
#+END_SRC

** EVIL

#+BEGIN_SRC emacs-lisp :results none
(use-package evil
:ensure t
:config
)
#+END_SRC

 #+begin_src emacs-lisp results none
   ;; (require 'evil)
   ;; (evil-mode 1)

   ;; ;for normal undo
   ;; (setq evil-want-fine-undo t)

   ;; ;;; esc quits
   ;; (define-key evil-normal-state-map [escape] 'keyboard-quit)
   ;; (define-key evil-visual-state-map [escape] 'keyboard-quit)
   ;; (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
   ;; (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
   ;; (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
   ;; (define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
   ;; (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)

   ;; ;searches
   ;; (global-set-key (kbd "C-*") 'evil-search-symbol-forward)
   ;; (global-set-key (kbd "C-#") 'evil-search-symbol-backward)



 #+end_src

** EVIL NERD Commenter
https://github.com/redguardtoo/evil-nerd-commenter

 #+BEGIN_SRC emacs-lisp :results none
(use-package evil-nerd-commenter
:ensure t
:config
)
;(evilnc-default-hotkeys)
;(setq evilnc-hotkey-comment-operator ",,")
 #+END_SRC


** expand region
https://github.com/magnars/expand-region.el

#+BEGIN_SRC emacs-lisp :results none
(use-package expand-region
 :ensure t
 :config
 :bind (
       ("M-2" . er/expand-region )
 )
)

#+END_SRC

:bind (("M-o l" . highlight-lines-matching-regexp)
         ("M-o r" . highlight-regexp)
         ("M-o w" . highlight-phrase)))


** Fill colum mode
#+BEGIN_SRC emacs-lisp :results none
(use-package fill-column-indicator
:ensure t
:config
)
#+END_SRC

** golden ratio
https://github.com/roman/golden-ratio.el

allows to dynamically resize the non currently edited pane

#+BEGIN_SRC emacs-lisp :results none
  (use-package golden-ratio
   :ensure t
   :config
   (require 'golden-ratio)
  ; (golden-ratio-mode 1)
   )
#+END_SRC
** google contacts

#+BEGIN_SRC emacs-lisp :results none
(use-package google-contacts
:ensure t
:config
)
#+END_SRC
** grizzl
for projectile fuzzy match
#+BEGIN_SRC emacs-lisp :results none
(use-package grizzl
 :ensure t
 :config
  )
#+END_SRC 

** Helm
*** load Helm
#+BEGIN_SRC emacs-lisp :results none
(use-package helm
:ensure t
:config
(require 'helm-config)
(helm-mode 1)
(global-set-key (kbd "M-x") 'helm-M-x)
(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
)
#+END_SRC
*** Helm configuration 
**** Helm viewing options config 

 #+BEGIN_SRC emacs-lisp :results none
(setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
       helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
       helm-ff-file-name-history-use-recentf t
)
 #+END_SRC
**** helm mini
 enable fuzzy matching:
 #+BEGIN_SRC emacs-lisp :results none
 (setq helm-buffers-fuzzy-matching t
       helm-recentf-fuzzy-match    t)
 #+END_SRC
**** search org folders
 #+BEGIN_SRC emacs-lisp :results none
 (use-package helm-cmd-t
 :ensure t
 :config
 (defvar my-org-folders (list  "~/org/files/")
   "my permanent folders for helm-mini")

 (defun helm-my-org (&optional arg)
   "Use C-u arg to work with repos."
   (interactive "P")
   (if (consp arg)
       (call-interactively 'helm-cmd-t-repos)
     (let ((helm-ff-transformer-show-only-basename nil))
       (helm :sources (mapcar (lambda (dir)
				(helm-cmd-t-get-create-source-dir dir))
                              my-org-folders)
             :candidate-number-limit 20
             :buffer "*helm-my-org:*"
             :input "org$ "))))
 )
 #+END_SRC

**** google suggest 
 #+BEGIN_SRC emacs-lisp :results none
 (when (executable-find "curl")
   (setq helm-google-suggest-use-curl-p t))
 #+END_SRC

**** helm man-woman (man doc reader)
 enable at point
 #+BEGIN_SRC emacs-lisp :results none
 (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
 #+END_SRC
**** helm locate
 enable fuzzy 
 #+BEGIN_SRC emacs-lisp :results none
 (setq helm-locate-fuzzy-match t)	    
 #+END_SRC
**** helm occur
no config needed 
** helm bibtex
https://github.com/tmalsburg/helm-bibtex

*** settings

#+BEGIN_SRC emacs-lisp :results none
(use-package helm-bibtex
 :ensure t
 :config

(autoload 'helm-bibtex "helm-bibtex" "" t)

(setq helm-bibtex-bibliography "/home/zeltak/org/files/Uni/papers/kloog.2015.bib")
;(setq helm-bibtex-notes-path "/home/zeltak/org/files/Uni/papers/notes/")
(setq helm-bibtex-library-path (list "/home/zeltak/Sync/Uni/pdf_lib/" "/home/zeltak/Sync/Uni/pdf_lib_gen/") ) 
(setq helm-bibtex-notes-extension ".org")

(setq helm-bibtex-format-citation-functions
  '((org-mode      . helm-bibtex-format-citation-org-link-to-PDF)
    (latex-mode    . helm-bibtex-format-citation-cite)
    (markdown-mode . helm-bibtex-format-citation-pandoc-citeproc)
    (default       . helm-bibtex-format-citation-default)))

;(setq helm-bibtex-additional-search-fields '(tags))
(setq helm-bibtex-additional-search-fields '(pubstate tags))



(setq helm-bibtex-browser-function
  (lambda (url _) (start-process "chromium" "*chromium*" "chromium" url)))

;(setq helm-bibtex-pdf-open-function
; (lambda (fpath)
 ;  (start-process "evince" "*helm-bibtex-evince*" "/usr/bin/evince" fpath)))
 )
#+END_SRC 

*** my papers 

#+BEGIN_SRC emacs-lisp :results none

 ;; Define helm-search with predefined search expression:
 (defun helm-bibtex-ikloog-publications ()
   "Search BibTeX entries authored by me"
   (interactive)
   (helm :sources '(helm-source-bibtex)
         :full-frame t
         :input "kloog article !prep !talk !conf !invtalk "
         :candidate-number-limit 500))

 ;; Bind this search function to Ctrl-x p:
 ;(global-set-key (kbd "C-x p") 'helm-bibtex-my-publications)
#+END_SRC

*** my papers (all)

#+BEGIN_SRC emacs-lisp :results none

 ;; Define helm-search with predefined search expression:
 (defun helm-bibtex-ikloog-publications-all ()
   "Search BibTeX entries authored by me (ALL including prep)"
   (interactive)
   (helm :sources '(helm-source-bibtex)
         :full-frame t
         :input "kloog"
         :candidate-number-limit 500))

 ;; Bind this search function to Ctrl-x p:
 ;(global-set-key (kbd "C-x p") 'helm-bibtex-my-publications)
#+END_SRC

*** my prep make it match on pubstate
#+BEGIN_SRC emacs-lisp :respults none

 ;; Define helm-search with predefined search expression:
 (defun helm-bibtex-ikloog-prep         ()
   "Search BibTeX entries in preperation with me"
   (interactive)
   (helm :sources '(helm-source-bibtex)
         :full-frame t
         :input "kloog prep"
         :candidate-number-limit 500))

 #+END_SRC

** helm mu
https://github.com/emacs-helm/helm-mu

When you would like to read an email without finishing the helm session, you can select the email and press ~Ctrl-z~
To search for contacts use `helm-mu-contacts`

#+BEGIN_SRC emacs-lisp :results none
(use-package helm-mu
 :ensure t
 :config
  )
#+END_SRC 

** helm-projectile

#+BEGIN_SRC emacs-lisp :results none
(use-package helm-projectile
 :ensure t
 :config
 
 )
#+END_SRC 


** Highlight symbol
https://github.com/nschum/highlight-symbol.el

highlight word at point and move forward next to other words

#+BEGIN_SRC emacs-lisp :results none
(use-package highlight-symbol
 :ensure t
 :config
 
 )
#+END_SRC 


** hydra
 #+BEGIN_SRC emacs-lisp :results none
(use-package hydra
:ensure t )
 #+END_SRC
** indent guide
#+BEGIN_SRC emacs-lisp :results none
(use-package indent-guide
:ensure t
:config
)


#+END_SRC
** ispell
#+BEGIN_SRC emacs-lisp :results none
(setq ispell-personal-dictionary "~/.emacs.d/ispell-dico-personal")
#+END_SRC
** key-chord

 #+BEGIN_SRC emacs-lisp :results none
(use-package key-chord 
  :ensure t
  :config
(setq key-chord-two-keys-delay 0.16)
(setq key-chord-one-key-delay 0.20)
)
#+END_SRC

** lentic mode
https://github.com/phillord/lentic

#+BEGIN_SRC emacs-lisp :results none
(use-package lentic
 :ensure t
 :config
 )
#+END_SRC


