settings.org
** TODO magit
   

https://github.com/magit/magit/blob/master/README.md#its-magit--an-emacs-mode-for-git

#+BEGIN_SRC emacs-lisp :results none

#+END_SRC 


** manage-minor-mode  
https://github.com/ShingoFukuyama/manage-minor-mode

Set minor-modes status for each major-mode in advance

#+BEGIN_SRC emacs-lisp :results none
(setq manage-minor-mode-default
      '((global
         (on   rainbow-mode)
         (off  line-number-mode))
        (emacs-lisp-mode
         (on   rainbow-delimiters-mode eldoc-mode show-paren-mode))
        (js2-mode
         (on   color-identifiers-mode)
         (off  flycheck-mode))))
#+END_SRC

** mic-parens
better parens match than bulit in Emacs one 
#+BEGIN_SRC emacs-lisp :results none
(use-package mic-paren
 :ensure t
 :config
  )
#+END_SRC
** mu4e-maildirs-extension
https://github.com/agpchil/mu4e-maildirs-extension
#+BEGIN_SRC emacs-lisp :results none
;(use-package mu4e-maildirs-extension
; :ensure t
; :config
;(setq mu4e-maildirs-extension-title "Mail")
;(setq mu4e-maildirs-extension-custom-list (quote ("INBOX" "Starred"  )))
; )
#+END_SRC

** TODO multiple-cursors
https://github.com/magnars/multiple-cursors.el

#+BEGIN_SRC emacs-lisp :results none
(use-package multiple-cursors
 :ensure t
 :config
 (require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)

 )
#+END_SRC 

When you want to add multiple cursors not based on continuous lines, but based on keywords in the buffer, use:

(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)

First mark the word, then add more cursors.

** open with

#+BEGIN_SRC emacs-lisp :results none
(use-package openwith 
:ensure t
:config
(require 'openwith)
(setq openwith-associations '(("\\.pdf\\'" "okular" (file))))
(setq openwith-associations '(("\\.mkv\\'" "mplayer" (file))))
(setq openwith-associations '(("\\.html\\'" "chromium" (file))))
(setq openwith-associations '(("\\.html\\'" "eww" (file))))
(setq openwith-associations '(("\\.mp4\\'" "vlc" (file))))
(setq openwith-associations '(("\\.ogm\\'" "vlc" (file))))
(setq openwith-associations '(("\\.avi\\'" "vlc" (file))))
(setq openwith-associations '(("\\.mpeg\\'" "vlc" (file))))
(setq openwith-associations '(("\\.mkv\\'" "vlc" (file))))
(openwith-mode t)
)
#+END_SRC
** org ref
*** load 
#+BEGIN_SRC emacs-lisp :results none
(add-to-list 'load-path "/home/zeltak/.emacs.g/org-ref/")
;; make sure you have dash, helm, helm-bibtex, ebib, s, f, hydra and key-chord
;; in your load-path
(require 'org-ref)
;; optional but very useful libraries in org-ref
(require 'doi-utils)
(require 'jmax-bibtex)
(require 'pubmed)
(require 'arxiv)
(require 'sci-id)
#+END_SRC

*** config 
#+BEGIN_SRC emacs-lisp :results none
;(org-babel-load-file "/home/zeltak/.emacs.g/extra/org-ref/org-ref.org")
(setq reftex-default-bibliography '("/home/zeltak/org/files/Uni/papers/kloog.2015.bib"))

;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "/home/zeltak/org/files/Uni/papers/notes/"
      org-ref-default-bibliography '("/home/zeltak/org/files/Uni/papers/kloog.2015.bib")
      org-ref-pdf-directory "/home/zeltak/Sync/Uni/pdf_lib/")

(setq bibtex-autokey-year-length 4
      bibtex-autokey-name-year-separator "-"
      bibtex-autokey-year-title-separator "-"
      bibtex-autokey-titleword-separator "-"
      bibtex-autokey-titlewords 2
      bibtex-autokey-titlewords-stretch 1
      bibtex-autokey-titleword-length 5)
#+END_SRC
** on-sudo
#+BEGIN_SRC emacs-lisp :results none
(add-to-list 'load-path "/home/zeltak/.emacs.g/ob-sudo/")
#+END_SRC
** org-downlaod							     :ATTACH:
   :PROPERTIES:
   :ID:       54e01618-35eb-45c5-b0b7-6f830faef316
   :Attachments: screenshot_2015-04-05_08:15:22.png
   :END:
 provides function to drag images from browser and link address
 $Note$ this requires package async to be installed, @async must be loaded before this package@

#+BEGIN_SRC emacs-lisp :results none
  (use-package org-download 
   :ensure t
   :config
   (setq-default org-download-heading-lvl nil)
   (setq-default org-download-image-dir "/home/zeltak/org/attach/images_2015")
  )
 #+END_SRC

*** old configs 

#+BEGIN_SRC emacs-lisp :results none
  ;; (setq org-download-method 'attach
  ;;        org-download-screenshot-method "scrot -s %s"
  ;;        org-download-backend (if (executable-find "curl") "curl \"%s\" -o \"%s\"" t)))
#+END_SRC

 #+BEGIN_SRC emacs-lisp :results none
  ; (load-file "~/.emacs.g/extra/org-download/org-download.el")
  ; (setq-default org-download-heading-lvl nil)
  ; (setq-default org-download-image-dir "/home/zeltak/org/attach/images_2015")
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :results none
;(if (string= system-name "voices") (setq-default org-download-image-dir "/home/zeltak/org/attach/images_2014/") (setq-default org-download-image-dir "/media/NAS/Uni/org/attach/images_2013/"))                                                           
 #+END_SRC
** org-dp (wrap code blocks functions) 
https://github.com/tj64/org-dp
*** load 
#+BEGIN_SRC emacs-lisp :results none
 (add-to-list 'load-path "/home/zeltak/.emacs.g/extra/org-dp/")
 (require 'org-dp-lib)
 #+END_SRC
*** TODO my wrap functions

#+BEGIN_SRC emacs-lisp :results none
(when (require 'org-dp-lib nil t)

;;;;;;;;;; wrap in elisp
  (defun z/wrap-elisp ()
        (org-dp-wrap-in-block
         nil '(src-block nil nil nil (:language "emacs-lisp" :preserve-indent 1  :parameters ":results none" ))))

;for hydra create interactive new functions
(defun z/hydra-wrap-elisp () (interactive) (beginning-of-line) (z/wrap-elisp))

;;;;;;;;;; wrap in bash
  (defun z/wrap-bash ()
        (org-dp-wrap-in-block
         nil '(src-block nil nil nil (:language "sh" :preserve-indent 1  :parameters ":results none" ))))

;for hydra create interactive new functions
(defun z/hydra-wrap-bash () (interactive) (beginning-of-line) (z/wrap-bash))


;;;;;;;;;; wrap in bash
  (defun z/wrap-example ()
        (org-dp-wrap-in-block
         nil '(src-block nil nil nil (:language "example" :preserve-indent 1  :parameters ":results none" ))))

;for hydra create interactive new functions
(defun z/hydra-wrap-example () (interactive) (beginning-of-line) (z/wrap-example))



;;;;;;;;;; wrap in R
  (defun z/wrap-R ()
        (org-dp-wrap-in-block
         nil '(src-block nil nil nil (:language "R" :preserve-indent 1  :parameters ":results none" ))))

;for hydra create interactive new functions
(defun z/hydra-wrap-R () (interactive) (beginning-of-line) (z/wrap-R))

;;;;;;;;;; wrap in latex
  (defun z/wrap-latex ()
        (org-dp-wrap-in-block
         nil '(src-block nil nil nil (:language "latex" :preserve-indent 1  :parameters ":results none" ))))

;for hydra create interactive new functions
(defun z/hydra-wrap-latex () (interactive) (beginning-of-line) (z/wrap-latex))


;end paren
     )
#+END_SRC

** org-gcal
#+BEGIN_SRC emacs-lisp :results none
(use-package org-gcal 
 :ensure t
 :config
(require 'org-gcal)
(setq org-gcal-client-id "915933520493-ppckdh9b038tb5u039c0b8s06bdkio98.apps.googleusercontent.com"
      org-gcal-client-secret "1hy--1nQE-xUjVyR8MLYt5W"
      org-gcal-file-alist '(
("ikloog@gmail.com" .  "~/org/files/agenda/gcal.org")

))
;for closing use package
)
#+END_SRC 
** TODO org-pandoc
https://github.com/kawabata/ox-pandoc

#+BEGIN_SRC emacs-lisp :results none
(use-package org-pandoc
 :ensure t
 :config
 )
#+END_SRC

** password-store
#+BEGIN_SRC emacs-lisp :results none
(add-to-list 'load-path "/home/zeltak/.emacs.g/password-store/")
(require 'password-store)
#+END_SRC
** pdf tools
https://github.com/politza/pdf-tools

#+BEGIN_SRC emacs-lisp :results none
(use-package pdf-tools
 :ensure t
 :config
  )
#+END_SRC 

** projectile

#+BEGIN_SRC emacs-lisp :results none
(use-package projectile
 :ensure t
 :config
(projectile-global-mode)
(setq projectile-completion-system 'grizzl)
 )
#+END_SRC 
** Rainbow mode
http://julien.danjou.info/projects/emacs-packages#rainbow-mode

#+BEGIN_SRC emacs-lisp :results none
(use-package rainbow-mode
:ensure t
:config
)

(dolist (hook '(css-mode-hook
                html-mode-hook
                js-mode-hook
                emacs-lisp-mode-hook
                org-mode-hook
                text-mode-hook
                ))
  (add-hook hook 'rainbow-mode))
#+END_SRC
** TODO Ranger
https://github.com/ralesi/ranger/

#+BEGIN_SRC emacs-lisp :results none
;(use-package ranger
; :ensure t
; :config
;
; )
#+END_SRC 


** scratch
Instant scratch buffer for current mode

http://pragmaticemacs.com/emacs/instant-scratch-buffer-for-current-mode/

#+BEGIN_SRC emacs-lisp :results none
(use-package scratch
 :ensure t
 :config
 (autoload 'scratch "scratch" nil t)
 )
#+END_SRC
** smex
#+BEGIN_SRC emacs-lisp :results none
(use-package smex
:ensure t
:config
)
#+END_SRC
** sunrise-commander
