settings.org
*** main 
http://www.emacswiki.org/emacs/Sunrise_Commander_Tips
#+BEGIN_SRC emacs-lisp :results none
(use-package sunrise-commander
 :ensure t
 :config
;;what to shoe in list view
(setq sr-attributes-display-mask '(nil nil t t t t t))
;start with no attributes in view (if set to nil)
(setq sr-show-file-attributes nil)
;sorting
(setq sr-listing-switches "--time-style=locale --group-directories-first -AlDhgG")


;;disbale F keys
;(setq sr-use-commander-keys nil)


;Here’s how to disable “click to visit file” and “cursor follows mouse”.
(setq sr-cursor-follows-mouse nil)
(setq sr-toggle-attribute 1)
(define-key sr-mode-map [mouse-1]        nil)
(define-key sr-mode-map [mouse-movement] nil)

;;nicer icons in modline
(setq sr-modeline-use-utf8-marks t)
;;where is avfs root
(setq sr-avfs-root "~/.avfs")

 )
#+END_SRC 
*** keys
#+BEGIN_SRC emacs-lisp :results none
(define-key sr-mode-map (kbd "/") 'sr-fuzzy-narrow) 
(define-key sr-mode-map (kbd "") 'er/sunrise-flatten) 
(define-key sr-mode-map (kbd "\\") 'sr-checkpoint-restore ) 
(define-key sr-mode-map (kbd "`") 'hydra-sunrise-leader/body ) 
;lynx like
(define-key sr-mode-map (kbd "<left>") 'sr-dired-prev-subdir ) 
(define-key sr-mode-map (kbd "<right>") 'sr-advertised-find-file ) 
;move back/forward im history
(define-key sr-mode-map (kbd "M-<left>") 'sr-history-prev ) 
(define-key sr-mode-map (kbd "M-<right>") 'sr-history-next ) 
#+END_SRC

*** TODO sunrise leader

#+BEGIN_SRC emacs-lisp :results none

(defhydra hydra-sunrise-leader  (:color blue :hint nil)

"

_a_:         _b_:         _c_:        _d_:        _e_:           _f_:         _g_:  
_h_: collapse org tree        _i_: insert text         _j_:       _k_:       _l_:          _m_: helm-mark        _n_: mark position       
_o_: mark prev   _p_ _q_ _r_ wdired   du_p_licate  _s_:       _t_: term           _u_:       
_v_:        _w_:        _x_:       _y_: kill ring       _z_: 
_q_: 

Sunrise:
【C-c C-d】recent dirs 【C-c C-q】wdired 【M-o】equal panes 【C-enter】open in next pane 
【N】copy/rename same dir 【s/r】sort/reverse 【X】exe file 【K】clone (cp tree) 【y】calc size


"

("a" find-file  )
("b"  nil  )
;("c"  company-complete )
("c"  auto-complete )
("d"  nil )
("e"  nil )
("f"  nil )
("g"  nil )
("h"  hide-sublevels )
("i"  hydra-editing-insert/body )
("j"  nil )
("k"  nil )
("l"  nil )
("m"  helm-mark-ring )
("n"  set-mark-command )
("o"  set-mark-command 4 )
("p"  duplicate-current-line-or-region )
("r"  sr-editable-pane )
("s"  nil )
("t"  sr-term-cd )
("T"  sr-term )
("<f9>"  sr-term-cd-newterm )
("u"  nil )
("v"  nil)
("w"  nil )
("x"  nil )
("y"  helm-show-kill-ring )
("z"  nil )
("\\"  z/insert-slsh )
(";"  comment-or-uncomment-region )
("q"  nil )

)
#+END_SRC

*** plugins
**** sunrise-x-popviewer

 #+BEGIN_SRC emacs-lisp :results none
 (use-package sunrise-x-popviewer
  :ensure t
  :config
(require 'sunrise-x-popviewer)
(sr-popviewer-mode 1)
;; to open in next pane and not new window
(setq sr-popviewer-select-viewer-action
         (lambda nil (let ((sr-running nil)) (other-window 1))))
  )
 #+END_SRC 
**** sunrise-x-mirror

#+BEGIN_SRC emacs-lisp :results none
(use-package sunrise-x-mirror
 :ensure t
 :config
 (require 'sunrise-x-mirror)
(setq sr-mirror-unionfs-impl (quote unionfs-fuse))
 )
#+END_SRC 


**** sunrise-x-loop
when yo need to copy of move any big files, just prefix the appropriate command with C-u.

#+BEGIN_SRC emacs-lisp :results none
(use-package sunrise-x-loop
 :ensure t
 :config
(require 'sunrise-x-loop) 
 )
#+END_SRC 

**** sunrise-x-modeline
#+BEGIN_SRC emacs-lisp :results none
  (use-package  sunrise-x-modeline
   :ensure t
   :config
   )
#+END_SRC 

**** sunrise-x-tabs

#+BEGIN_SRC emacs-lisp :results none
(use-package sunrise-x-tabs
 :ensure t
 :config
;(require 'sunrise‐x‐tabs) 
 )
#+END_SRC 

**** sunrise-x-checkpoints

#+BEGIN_SRC emacs-lisp :results none
(use-package sunrise-x-checkpoints
 :ensure t
 :config
  )
#+END_SRC 



 
*** functions
#+BEGIN_SRC emacs-lisp :results none
;;; Adding files opened with external apps to the history of recent files.
(defadvice openwith-file-handler
  (around advice-openwith-file-handler (operation &rest args))
  (condition-case description
      ad-do-it
    (error (progn
             (recentf-add-file (car args))
             (error (cadr description))))))
(ad-activate 'openwith-file-handler)

(defun er/sunrise-flatten ()
 (interactive)
 (sr-find "-type f"))

; Kill all sunrise and dired buffers when closing Sunrise Commander
(defun er/kill-all-sunrise-buffers()
      "Kill all dired buffers."
      (interactive)
      (save-excursion
        (let((count 0))
          (dolist(buffer (buffer-list))
            (set-buffer buffer)
            (when (derived-mode-p 'dired-mode 'sr-virtual-mode 'sr-mode)
                (setq count (1+ count))
                (kill-buffer buffer)))
          (message "Killed %i sunrise buffer(s)." count ))))
(setq sr-quit-hook 'er/kill-all-sunrise-buffers)

#+END_SRC 
** TODO sr-speedbar
SrSpeedbar is mode make SpeedBar show in Current Frame 
http://www.emacswiki.org/emacs/SrSpeedbar

#+BEGIN_SRC emacs-lisp :results none
(use-package sr-speedbar
 :ensure t
 :config
  )
#+END_SRC 

** swiper
#+BEGIN_SRC emacs-lisp :results none
(use-package swiper 
 :ensure t
 :config
 )
#+END_SRC

#+BEGIN_SRC emacs-lisp :results none
(defun swiper-at-point ()
  (interactive)
  (swiper (thing-at-point 'symbol)))
#+END_SRC

** transmission
need to install let-alist and seq packages from melpa
#+BEGIN_SRC emacs-lisp :results none
(add-to-list 'load-path "/home/zeltak/.emacs.g/transmission/")
(require 'transmission)
(setq transmission-host "10.0.0.2")
(setq transmission-rpc-path "/transmission/web/")
(setq transmission-rpc-auth '(:username "zeltak" :password "salar" ) )
#+END_SRC

** Undo tree
#+BEGIN_SRC emacs-lisp :results none
(use-package undo-tree 
:ensure t
:config
(global-undo-tree-mode 1)
(setq undo-tree-auto-save-history t)
(setq undo-tree-history-directory-alist '((".*" . "~/.emacs.t/undo-files")))
(setq undo-tree-mode-lighter "")	 
)
#+END_SRC

** unfill
https://github.com/purcell/unfill

makes or unmakes a marked section wider/shorter (look fill command)

#+BEGIN_SRC emacs-lisp :results none
(use-package unfill
:ensure t
:config
)
#+END_SRC

** weechat.el

#+BEGIN_SRC emacs-lisp :results none
  (use-package weechat
   :ensure t
   :config
  (require 'weechat)
(setq weechat-modules '(weechat-button
                        weechat-complete
                        weechat-spelling
                        weechat-corrector
                        weechat-tracking
                        weechat-notifications))
   )
#+END_SRC 

#+BEGIN_SRC emacs-lisp :results none
(eval-after-load 'weechat
  '(progn
     (setq weechat-host-default "karif.server-speed.net"
           weechat-port-default 9001
           weechat-color-list
           '(unspecified "black" "dark gray" "dark red" "red"
                         "dark green" "light green" "brown"
                         "yellow" "RoyalBlue3"
                         "light blue"
                         "dark magenta" "magenta" "dark cyan"
                         "light cyan" "gray" "white")
           weechat-prompt "> "
           weechat-notification-mode t
           weechat-auto-monitor-buffers t 
           weechat-complete-nick-ignore-self nil
           weechat-button-buttonize-nicks nil
           weechat-tracking-types '(:highlight (".+#weechat.el" . :message))
           weechat-sync-active-buffer t)
     (setq weechat-auto-monitor-buffers
      '("freenode.#gmpc"
        "bitlbee.rasi"))
     (set-face-background 'weechat-highlight-face "dark red")
     (set-face-foreground 'weechat-highlight-face "light grey")
     (add-hook 'weechat-mode-hook 'visual-line-mode)
     (tracking-mode)))
#+END_SRC

** winner-mode
#+BEGIN_SRC emacs-lisp :results none
(winner-mode 1)
#+END_SRC
** workgroup2
http://workgroups2.readthedocs.org/en/latest/guide/installation.html
#+BEGIN_SRC emacs-lisp :results none
;(use-package workgroups2
; :ensure t
; :config
;(workgroups-mode 1)        ; put this one at the bottom of .emacs (init.el)
;(require 'workgroups2)
;; Change workgroups session file
;(setq wg-session-file "~/.emacs.d/.emacs_workgroups") 
;)
#+END_SRC 

** TODO xah-find
http://ergoemacs.org/emacs/elisp-xah-find-text.html
This is the home page for “xah-find.el”.

This package provides emacs commands for find/replace in a directory, like {grep, rgrep, lgrep, unix sed}, but written entirely in emacs lisp.

This package provides these commands:

xah-find-text
xah-find-text-regex
xah-find-count
xah-find-replace-text
xah-find-replace-text-regex

Press Enter ↵ on a link to jump to the file location. (or mouse clic)k
Press 【Tab ↹】 to jump to next occurence. (【⇧ Shift+Tab ↹】 for previous)
Press 【Alt+p】 or 【Alt+n】 to move cursor to previous/next file name.

#+BEGIN_SRC emacs-lisp :results none
(use-package xah-find
 :ensure t
 :config
  )
#+END_SRC 

** Yasnippet
