settings.org
*** copy and indent lines

#+BEGIN_SRC emacs-lisp :results none
(defun prelude-indent-rigidly-and-copy-to-clipboard (begin end indent)
  "Copy the selected code region to the clipboard, indented according
to Markdown blockquote rules."
  (let ((buffer (current-buffer)))
    (with-temp-buffer
      (insert-buffer-substring-no-properties buffer begin end)
      (indent-rigidly (point-min) (point-max) indent)
      (clipboard-kill-ring-save (point-min) (point-max)))))

(defun prelude-indent-blockquote-and-copy-to-clipboard (begin end)
  "Copy the selected code region to the clipboard, indented according
to markdown blockquote rules (useful to copy snippets to StackOverflow, Assembla, Github."
  (interactive "r")
  (prelude-indent-rigidly-and-copy-to-clipboard begin end 4))

(defun prelude-indent-nested-blockquote-and-copy-to-clipboard (begin end)
  "Copy the selected code region to the clipboard, indented according
to markdown blockquote rules. Useful to add snippets under bullet points."
  (interactive "r")
  (prelude-indent-rigidly-and-copy-to-clipboard begin end 6))

#+END_SRC
*** search replace all document
@currently below code broken@

#+BEGIN_SRC emacs-lisp :results none
;(defun  z/search-replace-file ()
;(interactive)
;(goto-char (point-min))
;(query-replace-regexp ))

#+END_SRC
*** duplicate line/region 
#+BEGIN_SRC emacs-lisp :results none
(defun duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
If there's no region, the current line will be duplicated. However, if
there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end)))
      (dotimes (i arg)
        (goto-char end)
        (newline)
        (insert region)
        (setq end (point)))
      (goto-char (+ origin (* (length region) arg) arg)))))
#+END_SRC

**** old method for line only 
#+BEGIN_SRC emacs-lisp :results none
(defun duplicate-line()
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank)
)
#+END_SRC

*** copy current line
#+BEGIN_SRC emacs-lisp :results none
(defun z/copy-line (arg)
    "Copy lines (as many as prefix argument) in the kill ring.
      Ease of use features:
      - Move to start of next line.
      - Appends the copy on sequential calls.
      - Use newline as last char even on the last line of the buffer.
      - If region is active, copy its lines."
    (interactive "p")
    (let ((beg (line-beginning-position))
          (end (line-end-position arg)))
      (when mark-active
        (if (> (point) (mark))
            (setq beg (save-excursion (goto-char (mark)) (line-beginning-position)))
          (setq end (save-excursion (goto-char (mark)) (line-end-position)))))
      (if (eq last-command 'copy-line)
          (kill-append (buffer-substring beg end) (< end beg))
        (kill-ring-save beg end)))
    (kill-append "\n" nil)
    (beginning-of-line (or (and arg (1+ arg)) 2))
    (if (and arg (not (= 1 arg))) (message "%d lines copied" arg)))
#+END_SRC
*** auto spell correction function
from:
http://endlessparentheses.com/ispell-and-abbrev-the-perfect-auto-correct.html

this will store the abbrevs here: 
file:/home/zeltak/.emacs.d/abbrv/personal_abbrv.txt

 #+BEGIN_SRC emacs-lisp :results none
; (define-key ctl-x-map "\C-i" 'endless/ispell-word-then-abbrev)

 (define-prefix-command 'endless/toggle-map)
 ;; The manual recommends C-c for user keys, but C-x t is
 ;; always free, whereas C-c t is used by some modes.
 (define-key ctl-x-map "t" 'endless/toggle-map)
 (define-key endless/toggle-map "w" 'endless/ispell-word-then-abbrev)

 (defun endless/ispell-word-then-abbrev (p)
   "Call `ispell-word'. Then create an abbrev for the correction made.
 With prefix P, create local abbrev. Otherwise it will be global."
   (interactive "P")
   (let ((bef (downcase (or (thing-at-point 'word) ""))) aft)
     (call-interactively 'ispell-word)
     (setq aft (downcase (or (thing-at-point 'word) "")))
     (unless (string= aft bef)
       (message "\"%s\" now expands to \"%s\" %sally"
		bef aft (if p "loc" "glob"))
       (define-abbrev
         (if p local-abbrev-table global-abbrev-table)
         bef aft))))
 #+END_SRC

*** common used regex
**** delete all numeric characters
#+BEGIN_SRC emacs-lisp :results none
(defun z/regex-delete-numeric  ()
  "delete all numeric characters"
  (interactive)
  (goto-char (point-min))
  (replace-regexp "[0-9]" "")
)
#+END_SRC

*** Code box
#+BEGIN_SRC emacs-lisp :results none
(defun z/comment-box (b e)
  "Draw a box comment around the region but arrange for the region
to extend to at least the fill column. Place the point after the
comment box."
  (interactive "r")
  (let ((e (copy-marker e t)))
    (goto-char b)
    (end-of-line)
    (insert-char ?  (- fill-column (current-column)))
    (comment-box b e 1)
    (goto-char e)
    (set-marker e nil)))

#+END_SRC
*** insert quick snippets/Unicode texts

#+BEGIN_SRC emacs-lisp :results none
(defun z/insert-keyleft ()
  " insert 【   "
  (interactive)
  (insert "【")
  )

(defun z/insert-keyright ()
  " insert 】   "
  (interactive)
  (insert "】")
  )


(defun z/insert-keyboth ()
  " insert 【】  "
  (interactive)
  (insert "【】")
(backward-char 2)  
)

(defun z/insert-bashscript ()
  " insert #!/bin/sh  "
  (interactive)
  (insert "#!/bin/sh")

(defun z/insert-play ()
  " insert   ‣  "
  (interactive)
  (insert "‣")
)

)


#+END_SRC

*** kill line backwars 
#+BEGIN_SRC emacs-lisp :results none
(defun backward-kill-line (arg)
  "Kill ARG lines backward."
  (interactive "p")
  (kill-line (- 1 arg)))
#+END_SRC
** org
*** convert to same level header
#+BEGIN_SRC emacs-lisp :results none
(defun z/org-convert-header-samelevel  ()
                     (interactive)                                
                     (let ((current-prefix-arg '(4)))             
                       (call-interactively #'org-toggle-heading)))

#+END_SRC

*** tangle only code block at point 
#+BEGIN_SRC emacs-lisp :results none
(defun z/org-tangle-atpoint  ()
                     (interactive)                                
                     (let ((current-prefix-arg '(4)))             
                       (call-interactively #'org-babel-tangle)))

#+END_SRC

*** expand code block keys 
#+BEGIN_SRC emacs-lisp :results none
(defun pl/hot-expand (str)
  "Expand org template."
  (insert str)
  (org-try-structure-completion))

(with-eval-after-load "org"
  (define-key org-mode-map "<"
    (lambda () (interactive)
      (if (looking-back "^")
          (hydra-org-template/body)
        (self-insert-command 1)))))

#+END_SRC
*** TODO org refile with prefix
broken this way, causes erros in init 
#+BEGIN_SRC emacs-lisp :results none
;(fset 'z/prefix-org-refile (C-u M-x org-refile))   
#+END_SRC

*** agenda views
**** org agenda calendar
  
#+BEGIN_SRC emacs-lisp :results none
(defun z/org-agenda-calendar ()
"open work agenda"
(interactive)                                
(org-agenda nil "a")
)
#+END_SRC

**** org agenda work 

#+BEGIN_SRC emacs-lisp :results none
(defun z/org-agenda-work ()
"open work agenda"
(interactive)                                
(org-agenda nil "w")
)
#+END_SRC

**** org agenda search
**** org agenda Allan
#+BEGIN_SRC emacs-lisp :results none
(defun z/org-agenda-allan ()
"open work agenda"
(interactive)                                
(org-agenda nil "A")
)
#+END_SRC

**** org agenda Joel
#+BEGIN_SRC emacs-lisp :results none
(defun z/org-agenda-joel ()
"open work agenda"
(interactive)                                
(org-agenda nil "j")
)
#+END_SRC
**** org agenda cook

#+BEGIN_SRC emacs-lisp :results none
(defun z/org-agenda-cook ()
"open work agenda"
(interactive)                                
(org-agenda nil "f")
)
#+END_SRC

**** TODO org export to pdf
#+BEGIN_SRC emacs-lisp :results none
(fset 'expdf
      [?\C-c ?\C-e ?\l ?\o ])
#+END_SRC

*** comment code block 
#+BEGIN_SRC emacs-lisp :results none
(defun z/comment-org-in-src-block ()    
(interactive)
(org-edit-special)
(mark-whole-buffer)
(comment-dwim nil)
(org-edit-src-exit))

#+END_SRC
** hydra related
*** slash \
#+BEGIN_SRC emacs-lisp :results none
(defun z/insert-slsh ()
  " insert     "
  (interactive)
  (insert "\\")
)
#+END_SRC
** Root actions
*** edit file as root
#+BEGIN_SRC emacs-lisp :results none
(defun z-edit-file-as-root ()
  "Edit the file that is associated with the current buffer as root"
  (interactive)
  (if (buffer-file-name)
      (progn
        (setq file (concat "/sudo:root@localhost:" (buffer-file-name)))
        (find-file file))
    (message "Current buffer does not have an associated file.")))


#+END_SRC
** Buffers
