settings.org
*** kill other buffers
#+BEGIN_SRC emacs-lisp :results none
(defun z-kill-other-buffers ()
      "Kill all other buffers."
      (interactive)
      (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

#+END_SRC

*** movment in buffer
#+BEGIN_SRC emacs-lisp :results none
(defun next-user-buffer ()
  "Switch to the next user buffer.
User buffers are those whose name does not start with *."
  (interactive)
  (next-buffer)
  (let ((i 0))
    (while (and (string-match "^*" (buffer-name)) (< i 50))
      (setq i (1+ i)) (next-buffer) )))

(defun previous-user-buffer ()
  "Switch to the previous user buffer.
User buffers are those whose name does not start with *."
  (interactive)
  (previous-buffer)
  (let ((i 0))
    (while (and (string-match "^*" (buffer-name)) (< i 50))
      (setq i (1+ i)) (previous-buffer) )))

(defun next-emacs-buffer ()
  "Switch to the next emacs buffer.
Emacs buffers are those whose name starts with *."
  (interactive)
  (next-buffer)
  (let ((i 0))
    (while (and (not (string-match "^*" (buffer-name))) (< i 50))
      (setq i (1+ i)) (next-buffer) )))

(defun previous-emacs-buffer ()
  "Switch to the previous emacs buffer.
Emacs buffers are those whose name starts with *."
  (interactive)
  (previous-buffer)
  (let ((i 0))
    (while (and (not (string-match "^*" (buffer-name))) (< i 50))
      (setq i (1+ i)) (previous-buffer) )))


(defun switch-to-previous-buffer ()
  "Switch to previously open buffer.
Repeated invocations toggle between the two most recently open buffers."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))


#+END_SRC
*** save current file and close window
#+BEGIN_SRC emacs-lisp :results none
(defun z-save-buffer-close-window ()
  "DOCSTRING"
  (interactive)
    (save-buffer)
    (kill-this-buffer)
  )
#+END_SRC
** windows (panes)
*** resize via menu
#+BEGIN_SRC emacs-lisp :results none
(defun resize-window (&optional arg)    ; Hirose Yuuji and Bob Wiener
  "*Resize window interactively."
  (interactive "p")
  (if (one-window-p) (error "Cannot resize sole window"))
  (or arg (setq arg 1))
  (let (c)
    (catch 'done
      (while t
	(message
	 "h=heighten, s=shrink, w=widen, n=narrow (by %d);  1-9=unit, q=quit"
	 arg)
	(setq c (read-char))
	(condition-case ()
	    (cond
	     ((= c ?h) (enlarge-window arg))
	     ((= c ?s) (shrink-window arg))
	     ((= c ?w) (enlarge-window-horizontally arg))
	     ((= c ?n) (shrink-window-horizontally arg))
	     ((= c ?\^G) (keyboard-quit))
	     ((= c ?q) (throw 'done t))
	     ((and (> c ?0) (<= c ?9)) (setq arg (- c ?0)))
	     (t (beep)))
	  (error (beep)))))
    (message "Done.")))
#+END_SRC
*** swap window location
#+BEGIN_SRC emacs-lisp :results none
(defun transpose-windows (arg)
   "Transpose the buffers shown in two windows."
   (interactive "p")
   (let ((selector (if (>= arg 0) 'next-window 'previous-window)))
     (while (/= arg 0)
       (let ((this-win (window-buffer))
             (next-win (window-buffer (funcall selector))))
         (set-window-buffer (selected-window) next-win)
         (set-window-buffer (funcall selector) this-win)
         (select-window (funcall selector)))
       (setq arg (if (plusp arg) (1- arg) (1+ arg))))))
#+END_SRC

** open a specific dir
#+BEGIN_SRC emacs-lisp :results none
(defun ood () (interactive) (dired "/home/zeltak/org"))
#+END_SRC
** General emacs
*** create scratch buffer
#+BEGIN_SRC emacs-lisp :results none
(defun create-scratch-buffer nil
   "create a scratch buffer"
   (interactive)
   (switch-to-buffer (get-buffer-create "*scratch*"))
   (lisp-interaction-mode))  
#+END_SRC
** toggles 
*** auto narrow/widen

#+BEGIN_SRC emacs-lisp :results none
(defun z/narrow-or-widen-dwim ()
"If the buffer is narrowed, it widens. Otherwise, it narrows to region, or Org subtree."
(interactive)
(cond ((buffer-narrowed-p) (widen))
((region-active-p) (narrow-to-region (region-beginning) (region-end)))
((equal major-mode 'org-mode) (org-narrow-to-subtree))
(t (error "Please select a region to narrow to"))))
#+END_SRC

** outside Emacs
*** search google
#+BEGIN_SRC emacs-lisp :results none
(require 'thingatpt)

(defun google-search ()
  "Googles a query or region if any."
  (interactive)
  (browse-url
   (concat
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
    (if mark-active
        (buffer-substring (region-beginning) (region-end))
      (read-string "Google: ")))))
#+END_SRC

** helm 
*** swish-e

#+BEGIN_SRC emacs-lisp :results none
(defun helm-swish-e-candidates (query)
  "Generate a list of cons cells (swish-e result . path)."
  (let* ((result (shell-command-to-string
		  (format "swish-e -f ~/.swish-e/index.swish-e -x \"%%r\t%%p\n\" -w %s"
			  (shell-quote-argument query))))
	 (lines (s-split "\n" result t))
	 (candidates '()))
    (loop for line in lines
	  unless (or  (s-starts-with? "#" line)
		      (s-starts-with? "." line))
	  collect (cons line (cdr (s-split "\t" line))))))


(defun helm-swish-e (query)
  "Run a swish-e query and provide helm selection buffer of the results."
  (interactive "sQuery: ")
  (helm :sources `(((name . ,(format "swish-e: %s" query))
		    (candidates . ,(helm-swish-e-candidates query))
		    (action . (("open" . (lambda (f)
					   (find-file (car f)))))))
		   ((name . "New search")
		    (dummy)
		    (action . (("search" . (lambda (f)
					     (helm-swish-e helm-pattern)))))))))
#+END_SRC

** dired
*** marks
**** mark non org

#+BEGIN_SRC emacs-lisp :results none
(defun z/del-nonorg-files ()
(interactive)
(dired-mark-files-regexp "\\.org$") 
(dired-toggle-marks)
(dired-do-delete)
)


#+END_SRC
*** open in external (default) app
http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html

#+BEGIN_SRC emacs-lisp :results none
(defun z/dired-open-in-external-app ()
  "Open the current file or dired marked files in external app.
The app is chosen from your OS's preference."
  (interactive)
  (let* (
         (ξfile-list
          (if (string-equal major-mode "dired-mode")
              (dired-get-marked-files)
            (list (buffer-file-name))))
         (ξdo-it-p (if (<= (length ξfile-list) 5)
                       t
                     (y-or-n-p "Open more than 5 files? "))))

    (when ξdo-it-p
      (cond
       ((string-equal system-type "windows-nt")
        (mapc
         (lambda (fPath)
           (w32-shell-execute "open" (replace-regexp-in-string "/" "\\" fPath t t))) ξfile-list))
       ((string-equal system-type "darwin")
        (mapc
         (lambda (fPath) (shell-command (format "open \"%s\"" fPath)))  ξfile-list))
       ((string-equal system-type "gnu/linux")
        (mapc
         (lambda (fPath) (let ((process-connection-type nil)) (start-process "" nil "xdg-open" fPath))) ξfile-list))))))
#+END_SRC
*** open in WM/DE file manafer
#+BEGIN_SRC emacs-lisp :results none
(defun z/dired-open-in-desktop ()
  "Show current file in desktop (OS's file manager)."
  (interactive)
  (cond
   ((string-equal system-type "windows-nt")
    (w32-shell-execute "explore" (replace-regexp-in-string "/" "\\" default-directory t t)))
   ((string-equal system-type "darwin") (shell-command "open ."))
   ((string-equal system-type "gnu/linux")
    (let ((process-connection-type nil)) (start-process "" nil "xdg-open" "."))
    ;; (shell-command "xdg-open .") ;; 2013-02-10 this sometimes froze emacs till the folder is closed. ⁖ with nautilus
    ) ))
#+END_SRC

*** get marked files size
#+BEGIN_SRC emacs-lisp :results none
 (defun z/dired-get-size ()
  (interactive)
  (let ((files (dired-get-marked-files)))
    (with-temp-buffer
      (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
      (message "Size of all marked files: %s"
               (progn 
                 (re-search-backward "\\(^[0-9.,]+[A-Za-z]+\\).*total$")
                  (match-string 1))))))
#+END_SRC

* Key binds
  :PROPERTIES:
  :ID:       d4e38ca1-43ac-4fb5-a31f-5b432a4c0418
  :END:
** 1-unbind keys
#+BEGIN_SRC emacs-lisp :results none
(global-unset-key (kbd "<f1>"))
(global-unset-key (kbd "<f2>"))
(global-unset-key (kbd "<f3>"))
(global-unset-key (kbd "<f4>"))
(global-unset-key (kbd "<f5>"))
(global-unset-key (kbd "<f6>"))
(global-unset-key (kbd "<f7>"))
(global-unset-key (kbd "<f8>"))
(global-unset-key (kbd "<f9>"))
(global-unset-key (kbd "<f10>"))
(global-unset-key (kbd "<f11>"))
(global-unset-key (kbd "<f12>"))
(global-unset-key (kbd "C-v"))
(global-unset-key (kbd "C-M-p"))
(global-unset-key (kbd "C-M-e"))
(global-unset-key (kbd "C-M-b"))
(global-unset-key (kbd "C-M-b"))
(global-unset-key (kbd "C-M-t"))
#+END_SRC
** editing 
#+BEGIN_SRC emacs-lisp :results none
(key-chord-define-global "yy"     'z/copy-line)
(key-chord-define-global "jj"     'avy-goto-word-or-subword-1)
#+END_SRC


#+BEGIN_SRC emacs-lisp :results none
(global-set-key (kbd "C-<tab>") 'dabbrev-expand)
(define-key minibuffer-local-map (kbd "C-<tab>") 'dabbrev-expand)
#+END_SRC
** leader 
#+BEGIN_SRC emacs-lisp :results none

; (progn
;    (define-prefix-command 'xah-fly-leader-key-map)
;    (define-key xah-fly-leader-key-map (kbd "RET") (if (fboundp 'smex) 'smex 'execute-extended-command ))
;    (define-key xah-fly-leader-key-map (kbd "<backspace>") nil)
;    (define-key xah-fly-leader-key-map (kbd "<delete>") nil)
;    (define-key xah-fly-leader-key-map (kbd "SPC") nil )
;    (define-key xah-fly-leader-key-map (kbd "<menu>") 'exchange-point-and-mark)
;    (define-key xah-fly-leader-key-map (kbd "TAB") nil)
;    (define-key xah-fly-leader-key-map (kbd "\\") 'z/insert-slsh)
;    (define-key xah-fly-leader-key-map (kbd "r") 'query-replace)
;    (define-key xah-fly-leader-key-map (kbd "h") 'hippie-expand)

;  )

;(global-set-key (kbd "\\") 'xah-fly-leader-key-map)

#+END_SRC

  
** movment
#+BEGIN_SRC emacs-lisp :results none
(global-unset-key (kbd "M-`"))
(global-set-key (kbd "M-`") 'avy-goto-line)
#+END_SRC

** org
#+BEGIN_SRC emacs-lisp :results none
;Create an ID for the entry at point if it does not yet have one.
(global-set-key "\C-ca" 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key "\C-cs" 'org-babel-execute-subtree)
(global-set-key "\C-cl" 'org-store-link)
#+END_SRC

** hydra
*** hydra faces
#+BEGIN_SRC emacs-lisp :results none
(defface hydra-face-orange
    '((t (:foreground "orange" :bold t)))
  "Orange face. For fun.")

(defface hydra-face-red
    '((t (:foreground "red" :bold t)))
  "red face. For fun.")

(defface hydra-face-green
    '((t (:foreground "green" :bold t)))
  "green face. For fun.")
#+END_SRC

*** TODO hydra leader

#+BEGIN_SRC emacs-lisp :results none

(global-set-key
   (kbd "\\")
(defhydra hydra-leader  (:color blue :hint nil)

"

_a_:         _b_:         _c_:        _d_:        _e_:           _f_:         _g_:  
_h_: collapse org tree        _i_: insert text         _j_:       _k_:       _l_:          _m_: helm-mark        _n_: mark position       
_o_: mark prev      du_p_licate  _s_:       _t_: helm-top           _u_:       
_v_:        _w_:        _x_:       _y_: kill ring       _z_: 
_q_: 

"



("a" nil )
("b"  nil  )
;("c"  company-complete )
("c"  auto-complete )
("d"  nil )
("e"  nil )
("f"  nil )
("g"  nil )
("h"  hide-sublevels )
("i"  hydra-editing-insert/body )
("j"  nil )
("k"  nil )
("l"  nil )
("m"  helm-mark-ring )
("n"  set-mark-command )
("o"  set-mark-command 4 )
("p"  duplicate-current-line-or-region )
("r"  nil )
("s"  nil )
("t"  helm-top )
("u"  nil )
("v"  nil)
("w"  nil )
("x"  nil )
("y"  helm-show-kill-ring )
("z"  nil )
("\\"  z/insert-slsh )
(";"  comment-or-uncomment-region )
("q"  nil )

   ; (define-prefix-command 'xah-fly-leader-key-map)
   ; (define-key xah-fly-leader-key-map (kbd "RET") (if (fboundp 'smex) 'smex 'execute-extended-command ))
   ; (define-key xah-fly-leader-key-map (kbd "<backspace>") nil)
   ; (define-key xah-fly-leader-key-map (kbd "<delete>") nil)
   ; (define-key xah-fly-leader-key-map (kbd "SPC") nil )
   ; (define-key xah-fly-leader-key-map (kbd "<menu>") 'exchange-point-and-mark)
   ; (define-key xah-fly-leader-key-map (kbd "TAB") nil)
   ; (define-key xah-fly-leader-key-map (kbd "\\") 'z/insert-slsh)
   ; (define-key xah-fly-leader-key-map (kbd "r") 'query-replace)
   ; (define-key xah-fly-leader-key-map (kbd "h") 'hippie-expand)




))
#+END_SRC
*** Emacs//toggles (f1)
